huaweiwx/sduino/sduino/hardware/sduino/stm8/boards.txt
STM8L152C.menu.subboard.L152C8=L152C8
STM8L152C.menu.subboard.L152C8.build.series=-DSTM8L152C -DSTM8L
STM8L152C.menu.subboard.L152C8.build.mcu=STM8L15X_HD
STM8L152C.menu.subboard.L152C8.upload.mcu=stm8l152?8
STM8L152C.menu.subboard.L152C8.upload.maximum_size=65536
STM8L152R.menu.subboard.L152C8.upload.maximum_data_size=4096


STM8L152C.menu.subboard.L152C6=L152C6 (UDA)
STM8L152C.menu.subboard.L152C6.build.series=-DSTM8L152C -DSTM8L
STM8L152C.menu.subboard.L152C6.build.mcu=STM8L15X_MD
STM8L152C.menu.subboard.L152C6.upload.mcu=stm8l152?6
STM8L152C.menu.subboard.L152C6.upload.maximum_size=32768

STM8L152C.menu.subboard.L152C4=L152C4
STM8L152C.menu.subboard.L152C4.build.series=-DSTM8L152C -DSTM8L
STM8L152C.menu.subboard.L152C4.build.mcu=STM8L15X_MD
STM8L152C.menu.subboard.L152C4.upload.mcu=stm8l152?4
STM8L152C.menu.subboard.L152C4.upload.maximum_size=16384

STM8L152C.menu.clock_source.hsi=HSI(16M)
STM8L152C.menu.clock_source.hsi.build.osc=-DHSI=16
STM8L152C.menu.clock_source.hse16=HSE(16M)
STM8L152C.menu.clock_source.hse16.build.osc=-DHSE=16 -DHSE_VALUE=((uint32_t)16000000)
STM8L152C.menu.clock_source.hse8=HSE(8M)
STM8L152C.menu.clock_source.hse8.build.osc=-DHSE=8 -DHSE_VALUE=((uint32_t)8000000)
STM8L152C.menu.clock_source.lsi=LSI(38K) 
STM8L152C.menu.clock_source.lsi.build.osc=-DLSI=38 
STM8L152C.menu.clock_source.lse=LSE(32.768K)
STM8L152C.menu.clock_source.lse.build.osc=-DLSE=32

STM8L152C.menu.cpu_speed.s16=16M
STM8L152C.menu.cpu_speed.s16.build.f_cpu=16000000L {build.osc}
STM8L152C.menu.cpu_speed.s08=8M
STM8L152C.menu.cpu_speed.s08.build.f_cpu=8000000L {build.osc}
STM8L152C.menu.cpu_speed.s04=4M
STM8L152C.menu.cpu_speed.s04.build.f_cpu=4000000L {build.osc}
STM8L152C.menu.cpu_speed.s02=2M
STM8L152C.menu.cpu_speed.s02.build.f_cpu=2000000L {build.osc}
STM8L152C.menu.cpu_speed.s01=1M
STM8L152C.menu.cpu_speed.s01.build.f_cpu=1000000L {build.osc}
STM8L152C.menu.cpu_speed.lsi=LSI_38K
STM8L152C.menu.cpu_speed.lsi.build.f_cpu=38000L -DLSI=38
STM8L152C.menu.cpu_speed.lse=LSE_32.768K
STM8L152C.menu.cpu_speed.lse.build.f_cpu=32768L -DLSE=32768

STM8L152C.menu.jtag_swd.default=General_IO
STM8L152C.menu.jtag_swd.default.build.extra_flags={build.series}
STM8L152C.menu.jtag_swd.swim=Swim
STM8L152C.menu.jtag_swd.swim.build.extra_flags={build.series} -DENABLE_SWIM

STM8L152C.menu.log.default=Release
STM8L152C.menu.log.fatal=FATAL
STM8L152C.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
STM8L152C.menu.log.error=ERROR
STM8L152C.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
STM8L152C.menu.log.warning=WARNING
STM8L152C.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
STM8L152C.menu.log.info=INFO
STM8L152C.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
STM8L152C.menu.log.debug=DEBUG
STM8L152C.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
STM8L152C.menu.log.trace=TRACE
STM8L152C.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

# meaningless variables just to keep the makefile happy
STM8L152C.upload.speed=1

########################## STM8L152R  ####################################
STM8L152R.name=L152R

STM8L152R.upload.tool=stm8flash
STM8L152R.upload.protocol=stlinkv2
STM8L152R.upload.mcu=stm8l152?8
STM8L152R.upload.maximum_size=32768
STM8L152R.upload.maximum_data_size=2048

STM8L152R.build.stdlibpre=STM8L
STM8L152R.build.series=-DSTM8L152R -DSTM8L
STM8L152R.build.mcu=STM8L15X_MD
STM8L152R.build.f_cpu=16000000L
STM8L152R.build.board=L152R8
STM8L152R.build.core=sduino
STM8L152R.build.variant=stm8l152r

STM8L152R.menu.subboard.L152R8=L152R8(5D1 LED:PG2)
STM8L152R.menu.subboard.L152R8.build.series=-DSTM8L152R -DSTM8L -DLED_BUILTIN=PG2
STM8L152R.menu.subboard.L152R8.build.mcu=STM8L15X_HD
STM8L152R.menu.subboard.L152R8.upload.mcu=stm8l152?8
STM8L152R.menu.subboard.L152R8.upload.maximum_size=65536
STM8L152R.menu.subboard.L152R8.upload.maximum_data_size=4096

STM8L152R.menu.subboard.L152R6=L152R6
STM8L152R.menu.subboard.L152R6.build.series=-DSTM8L152R -DSTM8L
STM8L152R.menu.subboard.L152R6.build.mcu=STM8L15X_MDP
STM8L152R.menu.subboard.L152R6.upload.mcu=stm8l152?6
STM8L152R.menu.subboard.L152R6.upload.maximum_size=32768

STM8L152R.menu.subboard.L152R4=L152R4
STM8L152R.menu.subboard.L152R4.build.series=-DSTM8L152R -DSTM8L
STM8L152R.menu.subboard.L152R4.build.mcu=STM8L15X_MD
STM8L152R.menu.subboard.L152R4.upload.mcu=stm8l152?4
STM8L152R.menu.subboard.L152R4.upload.maximum_size=16384

STM8L152R.menu.clock_source.hsi=HSI(16M)
STM8L152R.menu.clock_source.hsi.build.osc=-DHSI=16
STM8L152R.menu.clock_source.hse16=HSE(16M)
STM8L152R.menu.clock_source.hse16.build.osc=-DHSE=16 -DHSE_VALUE=((uint32_t)16000000)
STM8L152R.menu.clock_source.hse8=HSE(8M)
STM8L152R.menu.clock_source.hse8.build.osc=-DHSE=8 -DHSE_VALUE=((uint32_t)8000000)
STM8L152R.menu.clock_source.lsi=LSI(38K) 
STM8L152R.menu.clock_source.lsi.build.osc=-DLSI=38 
STM8L152R.menu.clock_source.lse=LSE(32.768K)
STM8L152R.menu.clock_source.lse.build.osc=-DLSE=32

STM8L152R.menu.cpu_speed.s16=16M
STM8L152R.menu.cpu_speed.s16.build.f_cpu=16000000L {build.osc}
STM8L152R.menu.cpu_speed.s08=8M
STM8L152R.menu.cpu_speed.s08.build.f_cpu=8000000L {build.osc}
STM8L152R.menu.cpu_speed.s04=4M
STM8L152R.menu.cpu_speed.s04.build.f_cpu=4000000L {build.osc}
STM8L152R.menu.cpu_speed.s02=2M
STM8L152R.menu.cpu_speed.s02.build.f_cpu=2000000L {build.osc}
STM8L152R.menu.cpu_speed.s01=1M
STM8L152R.menu.cpu_speed.s01.build.f_cpu=1000000L {build.osc}
STM8L152R.menu.cpu_speed.lsi=LSI_38K
STM8L152R.menu.cpu_speed.lsi.build.f_cpu=38000L -DLSI=38
STM8L152R.menu.cpu_speed.lse=LSE_32.768K
STM8L152R.menu.cpu_speed.lse.build.f_cpu=32768L -DLSE=32

STM8L152R.menu.jtag_swd.default=General_IO
STM8L152R.menu.jtag_swd.default.build.extra_flags={build.series}
STM8L152R.menu.jtag_swd.swim=Swim
STM8L152R.menu.jtag_swd.swim.build.extra_flags={build.series} -DENABLE_SWIM

STM8L152R.menu.log.default=Release
STM8L152R.menu.log.fatal=FATAL
STM8L152R.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
STM8L152R.menu.log.error=ERROR
STM8L152R.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
STM8L152R.menu.log.warning=WARNING
STM8L152R.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
STM8L152R.menu.log.info=INFO
STM8L152R.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
STM8L152R.menu.log.debug=DEBUG
STM8L152R.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
STM8L152R.menu.log.trace=TRACE
STM8L152R.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

# meaningless variables just to keep the makefile happy
STM8L152R.upload.speed=1

######################### The end  ####################################
